[{"id": "G0018", "name": "admin@338", "associated_groups": "", "description": "admin@338 is a China-based cyber threat group. It has previously used newsworthy events as lures to deliver malware and has primarily targeted organizations involved in financial, economic, and trade policy, typically using publicly available RATs such as PoisonIvy, as well as some non-public backdoors.", "url": "/groups/G0018"}, {"id": "G0130", "name": "Ajax Security Team", "associated_groups": "Operation Woolen-Goldfish, AjaxTM, Rocket Kitten, Flying Kitten, Operation Saffron Rose", "description": "Ajax Security Team is a group that has been active since at least 2010 and believed to be operating out of Iran. By 2014 Ajax Security Team transitioned from website defacement operations to malware-based cyber espionage campaigns targeting the US defense industrial base and Iranian users of anti-censorship technologies.", "url": "/groups/G0130"}, {"id": "G1024", "name": "Akira", "associated_groups": "GOLD SAHARA, PUNK SPIDER", "description": "Akira is a ransomware variant and ransomware deployment entity active since at least March 2023. Akira uses compromised credentials to access single-factor external access mechanisms such as VPNs for initial access, then various publicly-available tools and techniques for lateral movement. Akira operations are associated with \"double extortion\" ransomware activity, where data is exfiltrated from victim environments prior to encryption, with threats to publish files if a ransom is not paid. Technical analysis of Akira ransomware indicates multiple overlaps with and similarities to Conti malware.", "url": "/groups/G1024"}, {"id": "G1000", "name": "ALLANITE", "associated_groups": "Palmetto Fusion", "description": "ALLANITE is a suspected Russian cyber espionage group, that has primarily targeted the electric utility sector within the United States and United Kingdom. The group's tactics and techniques are reportedly similar to Dragonfly, although ALLANITEs technical capabilities have not exhibited disruptive or destructive abilities. It has been suggested that the group maintains a presence in ICS for the purpose of gaining understanding of processes and to maintain persistence.", "url": "/groups/G1000"}, {"id": "G0138", "name": "Andariel", "associated_groups": "Silent Chollima, PLUTONIUM, Onyx Sleet", "description": "Andariel is a North Korean state-sponsored threat group that has been active since at least 2009. Andariel has primarily focused its operations--which have included destructive attacks--against South Korean government agencies, military organizations, and a variety of domestic companies; they have also conducted cyber financial operations against ATMs, banks, and cryptocurrency exchanges. Andariel's notable activity includes Operation Black Mine, Operation GoldenAxe, and Campaign Rifle.Andariel is considered a sub-set of Lazarus Group, and has been attributed to North Korea's Reconnaissance General Bureau.North Korean group definitions are known to have significant overlap, and some security researchers report all North Korean state-sponsored cyber activity under the name Lazarus Group instead of tracking clusters or subgroups.", "url": "/groups/G0138"}, {"id": "G1007", "name": "Aoqin Dragon", "associated_groups": "", "description": "Aoqin Dragon is a suspected Chinese cyber espionage threat group that has been active since at least 2013. Aoqin Dragon has primarily targeted government, education, and telecommunication organizations in Australia, Cambodia, Hong Kong, Singapore, and Vietnam. Security researchers noted a potential association between Aoqin Dragon and UNC94, based on malware, infrastructure, and targets.", "url": "/groups/G1007"}, {"id": "G1028", "name": "APT-C-23", "associated_groups": "Mantis, Arid Viper, Desert Falcon, TAG-63, Grey Karkadann, Big Bang APT, Two-tailed Scorpion", "description": "APT-C-23 is a threat group that has been active since at least 2014. APT-C-23 has primarily focused its operations on the Middle East, including Israeli military assets. APT-C-23 has developed mobile spyware targeting Android and iOS devices since 2017.", "url": "/groups/G1028"}, {"id": "G0099", "name": "APT-C-36", "associated_groups": "Blind Eagle", "description": "APT-C-36 is a suspected South America espionage group that has been active since at least 2018. The group mainly targets Colombian government institutions as well as important corporations in the financial sector, petroleum industry, and professional manufacturing.", "url": "/groups/G0099"}, {"id": "G0006", "name": "APT1", "associated_groups": "Comment Crew, Comment Group, Comment Panda", "description": "APT1 is a Chinese threat group that has been attributed to the 2nd Bureau of the People’s Liberation Army (PLA) General Staff Department’s (GSD) 3rd Department, commonly known by its Military Unit Cover Designator (MUCD) as Unit 61398.", "url": "/groups/G0006"}, {"id": "G0005", "name": "APT12", "associated_groups": "IXESHE, DynCalc, Numbered Panda, DNSCALC", "description": "APT12 is a threat group that has been attributed to China. The group has targeted a variety of victims including but not limited to media outlets, high-tech companies, and multiple governments.", "url": "/groups/G0005"}, {"id": "G0023", "name": "APT16", "associated_groups": "", "description": "APT16 is a China-based threat group that has launched spearphishing campaigns targeting Japanese and Taiwanese organizations.", "url": "/groups/G0023"}, {"id": "G0025", "name": "APT17", "associated_groups": "Deputy Dog", "description": "APT17 is a China-based threat group that has conducted network intrusions against U.S. government entities, the defense industry, law firms, information technology companies, mining companies, and non-government organizations.", "url": "/groups/G0025"}, {"id": "G0026", "name": "APT18", "associated_groups": "TG-0416, Dynamite Panda, Threat Group-0416", "description": "APT18 is a threat group that has operated since at least 2009 and has targeted a range of industries, including technology, manufacturing, human rights groups, government, and medical.", "url": "/groups/G0026"}, {"id": "G0073", "name": "APT19", "associated_groups": "Codoso, C0d0so0, Codoso Team, Sunshop Group", "description": "APT19 is a Chinese-based threat group that has targeted a variety of industries, including defense, finance, energy, pharmaceutical, telecommunications, high tech, education, manufacturing, and legal services. In 2017, a phishing campaign was used to target seven law and investment firms.  Some analysts track APT19 and Deep Panda as the same group, but it is unclear from open source information if the groups are the same.", "url": "/groups/G0073"}, {"id": "G0007", "name": "APT28", "associated_groups": "IRON TWILIGHT, SNAKEMACKEREL, Swallowtail, Group 74, Sednit, Sofacy, Pawn Storm, Fancy Bear, STRONTIUM, Tsar Team, Threat Group-4127, TG-4127, Forest Blizzard, FROZENLAKE", "description": "APT28 is a threat group that has been attributed to Russia's General Staff Main Intelligence Directorate (GRU) 85th Main Special Service Center (GTsSS) military unit 26165. This group has been active since at least 2004.APT28 reportedly compromised the Hillary Clinton campaign, the Democratic National Committee, and the Democratic Congressional Campaign Committee in 2016 in an attempt to interfere with the U.S. presidential election. In 2018, the US indicted five GRU Unit 26165 officers associated with APT28 for cyber operations (including close-access operations) conducted between 2014 and 2018 against the World Anti-Doping Agency (WADA), the US Anti-Doping Agency, a US nuclear facility, the Organization for the Prohibition of Chemical Weapons (OPCW), the Spiez Swiss Chemicals Laboratory, and other organizations. Some of these were conducted with the assistance of GRU Unit 74455, which is also referred to as Sandworm Team.", "url": "/groups/G0007"}, {"id": "G0016", "name": "APT29", "associated_groups": "IRON RITUAL, IRON HEMLOCK, NobleBaron, Dark Halo, StellarParticle, NOBELIUM, UNC2452, YTTRIUM, The Dukes, Cozy Bear, CozyDuke, SolarStorm, Blue Kitsune, UNC3524, Midnight Blizzard", "description": "APT29 is threat group that has been attributed to Russia's Foreign Intelligence Service (SVR). They have operated since at least 2008, often targeting government networks in Europe and NATO member countries, research institutes, and think tanks. APT29 reportedly compromised the Democratic National Committee starting in the summer of 2015.In April 2021, the US and UK governments attributed the SolarWinds Compromise to the SVR; public statements included citations to APT29, Cozy Bear, and The Dukes. Industry reporting also referred to the actors involved in this campaign as UNC2452, NOBELIUM, StellarParticle, Dark Halo, and SolarStorm.", "url": "/groups/G0016"}, {"id": "G0022", "name": "APT3", "associated_groups": "Gothic Panda, Pirpi, UPS Team, Buckeye, Threat Group-0110, TG-0110", "description": "APT3 is a China-based threat group that researchers have attributed to China's Ministry of State Security. This group is responsible for the campaigns known as Operation Clandestine Fox, Operation Clandestine Wolf, and Operation Double Tap. As of June 2015, the group appears to have shifted from targeting primarily US victims to primarily political organizations in Hong Kong.", "url": "/groups/G0022"}, {"id": "G0013", "name": "APT30", "associated_groups": "", "description": "APT30 is a threat group suspected to be associated with the Chinese government. While Naikon shares some characteristics with APT30, the two groups do not appear to be exact matches.", "url": "/groups/G0013"}, {"id": "G0050", "name": "APT32", "associated_groups": "SeaLotus, OceanLotus, APT-C-00, Canvas Cyclone, BISMUTH", "description": "APT32 is a suspected Vietnam-based threat group that has been active since at least 2014. The group has targeted multiple private sector industries as well as foreign governments, dissidents, and journalists with a strong focus on Southeast Asian countries like Vietnam, the Philippines, Laos, and Cambodia. They have extensively used strategic web compromises to compromise victims.", "url": "/groups/G0050"}, {"id": "G0064", "name": "APT33", "associated_groups": "HOLMIUM, Elfin, Peach Sandstorm", "description": "APT33 is a suspected Iranian threat group that has carried out operations since at least 2013. The group has targeted organizations across multiple industries in the United States, Saudi Arabia, and South Korea, with a particular interest in the aviation and energy sectors.", "url": "/groups/G0064"}, {"id": "G0067", "name": "APT37", "associated_groups": "InkySquid, ScarCruft, Reaper, Group123, TEMP.Reaper, Ricochet Chollima", "description": "APT37 is a North Korean state-sponsored cyber espionage group that has been active since at least 2012. The group has targeted victims primarily in South Korea, but also in Japan, Vietnam, Russia, Nepal, China, India, Romania, Kuwait, and other parts of the Middle East. APT37 has also been linked to the following campaigns between 2016-2018: Operation Daybreak, Operation Erebus, Golden Time, Evil New Year, Are you Happy?, FreeMilk, North Korean Human Rights, and Evil New Year 2018.North Korean group definitions are known to have significant overlap, and some security researchers report all North Korean state-sponsored cyber activity under the name Lazarus Group instead of tracking clusters or subgroups.", "url": "/groups/G0067"}, {"id": "G0082", "name": "APT38", "associated_groups": "NICKEL GLADSTONE, BeagleBoyz, Bluenoroff, Stardust Chollima, Sapphire Sleet, COPERNICIUM", "description": "APT38 is a North Korean state-sponsored threat group that specializes in financial cyber operations; it has been attributed to the Reconnaissance General Bureau. Active since at least 2014, APT38 has targeted banks, financial institutions, casinos, cryptocurrency exchanges, SWIFT system endpoints, and ATMs in at least 38 countries worldwide. Significant operations include the 2016 Bank of Bangladesh heist, during which APT38 stole $81 million, as well as attacks against Bancomext  and Banco de Chile ; some of their attacks have been destructive.North Korean group definitions are known to have significant overlap, and some security researchers report all North Korean state-sponsored cyber activity under the name Lazarus Group instead of tracking clusters or subgroups.", "url": "/groups/G0082"}, {"id": "G0087", "name": "APT39", "associated_groups": "ITG07, Chafer, Remix Kitten", "description": "APT39 is one of several names for cyber espionage activity conducted by the Iranian Ministry of Intelligence and Security (MOIS) through the front company Rana Intelligence Computing since at least 2014. APT39 has primarily targeted the travel, hospitality, academic, and telecommunications industries in Iran and across Asia, Africa, Europe, and North America to track individuals and entities considered to be a threat by the MOIS.", "url": "/groups/G0087"}, {"id": "G0096", "name": "APT41", "associated_groups": "Wicked Panda, Brass Typhoon, BARIUM", "description": "APT41 is a threat group that researchers have assessed as Chinese state-sponsored espionage group that also conducts financially-motivated operations. Active since at least 2012, APT41 has been observed targeting healthcare, telecom, technology, and video game industries in 14 countries. APT41 overlaps at least partially with public reporting on groups including BARIUM and Winnti Group.", "url": "/groups/G0096"}, {"id": "G1023", "name": "APT5", "associated_groups": "Mulberry Typhoon, MANGANESE, BRONZE FLEETWOOD, Keyhole Panda, UNC2630", "description": "APT5 is a China-based espionage actor that has been active since at least 2007 primarily targeting the telecommunications, aerospace, and defense industries throughout the U.S., Europe, and Asia. APT5 has displayed advanced tradecraft and significant interest in compromising networking devices and their underlying software including through the use of zero-day exploits.", "url": "/groups/G1023"}, {"id": "G0143", "name": "Aquatic Panda", "associated_groups": "", "description": "Aquatic Panda is a suspected China-based threat group with a dual mission of intelligence collection and industrial espionage. Active since at least May 2020, Aquatic Panda has primarily targeted entities in the telecommunications, technology, and government sectors.", "url": "/groups/G0143"}, {"id": "G0001", "name": "Axiom", "associated_groups": "Group 72", "description": "Axiom is a suspected Chinese cyber espionage group that has targeted the aerospace, defense, government, manufacturing, and media sectors since at least 2008. Some reporting suggests a degree of overlap between Axiom and Winnti Group but the two groups appear to be distinct based on differences in reporting on TTPs and targeting.", "url": "/groups/G0001"}, {"id": "G0135", "name": "BackdoorDiplomacy", "associated_groups": "", "description": "BackdoorDiplomacy is a cyber espionage threat group that has been active since at least 2017. BackdoorDiplomacy has targeted Ministries of Foreign Affairs and telecommunication companies in Africa, Europe, the Middle East, and Asia.", "url": "/groups/G0135"}, {"id": "G1002", "name": "BITTER", "associated_groups": "T-APT-17", "description": "BITTER is a suspected South Asian cyber espionage threat group that has been active since at least 2013. BITTER has targeted government, energy, and engineering organizations in Pakistan, China, Bangladesh, and Saudi Arabia.", "url": "/groups/G1002"}, {"id": "G0063", "name": "BlackOasis", "associated_groups": "", "description": "BlackOasis is a Middle Eastern threat group that is believed to be a customer of Gamma Group. The group has shown interest in prominent figures in the United Nations, as well as opposition bloggers, activists, regional news correspondents, and think tanks.   A group known by Microsoft as NEODYMIUM is reportedly associated closely with BlackOasis operations, but evidence that the group names are aliases has not been identified.", "url": "/groups/G0063"}, {"id": "G0098", "name": "BlackTech", "associated_groups": "Palmerworm", "description": "BlackTech is a suspected Chinese cyber espionage group that has primarily targeted organizations in East Asia--particularly Taiwan, Japan, and Hong Kong--and the US since at least 2013. BlackTech has used a combination of custom malware, dual-use tools, and living off the land tactics to compromise media, construction, engineering, electronics, and financial company networks.", "url": "/groups/G0098"}, {"id": "G0108", "name": "Blue Mockingbird", "associated_groups": "", "description": "Blue Mockingbird is a cluster of observed activity involving Monero cryptocurrency-mining payloads in dynamic-link library (DLL) form on Windows systems. The earliest observed Blue Mockingbird tools were created in December 2019.", "url": "/groups/G0108"}, {"id": "G0097", "name": "Bouncing Golf", "associated_groups": "", "description": "Bouncing Golf is a cyberespionage campaign targeting Middle Eastern countries.", "url": "/groups/G0097"}, {"id": "G0060", "name": "BRONZE BUTLER", "associated_groups": "REDBALDKNIGHT, Tick", "description": "BRONZE BUTLER is a cyber espionage group with likely Chinese origins that has been active since at least 2008. The group primarily targets Japanese organizations, particularly those in government, biotechnology, electronics manufacturing, and industrial chemistry.", "url": "/groups/G0060"}, {"id": "G0008", "name": "Carbanak", "associated_groups": "Anunak", "description": "Carbanak is a cybercriminal group that has used Carbanak malware to target financial institutions since at least 2013. Carbanak may be linked to groups tracked separately as Cobalt Group and FIN7 that have also used Carbanak malware.", "url": "/groups/G0008"}, {"id": "G0114", "name": "Chimera", "associated_groups": "", "description": "Chimera is a suspected China-based threat group that has been active since at least 2018 targeting the semiconductor industry in Taiwan as well as data from the airline industry.", "url": "/groups/G0114"}, {"id": "G1021", "name": "Cinnamon Tempest", "associated_groups": "DEV-0401, Emperor Dragonfly, BRONZE STARLIGHT", "description": "Cinnamon Tempest is a China-based threat group that has been active since at least 2021 deploying multiple strains of ransomware based on the leaked Babuk source code. Cinnamon Tempest does not operate their ransomware on an affiliate model or purchase access but appears to act independently in all stages of the attack lifecycle. Based on victimology, the short lifespan of each ransomware variant, and use of malware attributed to government-sponsored threat groups, Cinnamon Tempest may be motivated by intellectual property theft or cyberespionage rather than financial gain.", "url": "/groups/G1021"}, {"id": "G0003", "name": "Cleaver", "associated_groups": "Threat Group 2889, TG-2889", "description": "Cleaver is a threat group that has been attributed to Iranian actors and is responsible for activity tracked as Operation Cleaver.  Strong circumstantial evidence suggests Cleaver is linked to Threat Group 2889 (TG-2889).", "url": "/groups/G0003"}, {"id": "G0080", "name": "Cobalt Group", "associated_groups": "GOLD KINGSWOOD, Cobalt Gang, Cobalt Spider", "description": "Cobalt Group is a financially motivated threat group that has primarily targeted financial institutions since at least 2016. The group has conducted intrusions to steal money via targeting ATM systems, card processing, payment systems and SWIFT systems. Cobalt Group has mainly targeted banks in Eastern Europe, Central Asia, and Southeast Asia. One of the alleged leaders was arrested in Spain in early 2018, but the group still appears to be active. The group has been known to target organizations in order to use their access to then compromise additional victims. Reporting indicates there may be links between Cobalt Group and both the malware Carbanak and the group Carbanak.", "url": "/groups/G0080"}, {"id": "G0142", "name": "Confucius", "associated_groups": "Confucius APT", "description": "Confucius is a cyber espionage group that has primarily targeted military personnel, high-profile personalities, business persons, and government organizations in South Asia since at least 2013. Security researchers have noted similarities between Confucius and Patchwork, particularly in their respective custom malware code and targets.", "url": "/groups/G0142"}, {"id": "G0052", "name": "CopyKittens", "associated_groups": "", "description": "CopyKittens is an Iranian cyber espionage group that has been operating since at least 2013. It has targeted countries including Israel, Saudi Arabia, Turkey, the U.S., Jordan, and Germany. The group is responsible for the campaign known as Operation Wilted Tulip.", "url": "/groups/G0052"}, {"id": "G1012", "name": "CURIUM", "associated_groups": "Crimson Sandstorm, TA456, Tortoise Shell", "description": "CURIUM is an Iranian threat group first reported in November 2021 that has invested in building a relationship with potential targets via social media over a period of months to establish trust and confidence before sending malware. Security researchers note CURIUM has demonstrated great patience and persistence by chatting with potential targets daily and sending benign files to help lower their security consciousness.", "url": "/groups/G1012"}, {"id": "G1027", "name": "CyberAv3ngers", "associated_groups": "Soldiers of Soloman", "description": "The CyberAv3ngers are a suspected Iranian Government Islamic Revolutionary Guard Corps (IRGC)-affiliated APT group. The CyberAv3ngers have been known to be active since at least 2020, with disputed and false claims of critical infrastructure compromises in Israel.In 2023, the CyberAv3ngers engaged in a global targeting and hacking of the Unitronics Programmable Logic Controller (PLC) with Human-Machine Interface (HMI). This PLC can be found in multiple sectors, including water and wastewater, energy, food and beverage manufacturing, and healthcare. The most notable feature of this attack was the defacement of the devices user interface.", "url": "/groups/G1027"}, {"id": "G0070", "name": "Dark Caracal", "associated_groups": "", "description": "Dark Caracal is threat group that has been attributed to the Lebanese General Directorate of General Security (GDGS) and has operated since at least 2012.", "url": "/groups/G0070"}, {"id": "G0012", "name": "Darkhotel", "associated_groups": "DUBNIUM, Zigzag Hail", "description": "Darkhotel is a suspected South Korean threat group that has targeted victims primarily in East Asia since at least 2004. The group's name is based on cyber espionage operations conducted via hotel Internet networks against traveling executives and other select guests. Darkhotel has also conducted spearphishing campaigns and infected victims through peer-to-peer and file sharing networks.", "url": "/groups/G0012"}, {"id": "G0079", "name": "DarkHydrus", "associated_groups": "", "description": "DarkHydrus is a threat group that has targeted government agencies and educational institutions in the Middle East since at least 2016. The group heavily leverages open-source tools and custom payloads for carrying out attacks.", "url": "/groups/G0079"}, {"id": "G0105", "name": "DarkVishnya", "associated_groups": "", "description": "DarkVishnya is a financially motivated threat actor targeting financial institutions in Eastern Europe. In 2017-2018 the group attacked at least 8 banks in this region.", "url": "/groups/G0105"}, {"id": "G0009", "name": "Deep Panda", "associated_groups": "Shell Crew, WebMasters, KungFu Kittens, PinkPanther, Black Vine", "description": "Deep Panda is a suspected Chinese threat group known to target many industries, including government, defense, financial, and telecommunications.  The intrusion into healthcare company Anthem has been attributed to Deep Panda.  This group is also known as Shell Crew, WebMasters, KungFu Kittens, and PinkPanther.  Deep Panda also appears to be known as Black Vine based on the attribution of both group names to the Anthem intrusion.  Some analysts track Deep Panda and APT19 as the same group, but it is unclear from open source information if the groups are the same.", "url": "/groups/G0009"}, {"id": "G0035", "name": "Dragonfly", "associated_groups": "TEMP.Isotope, DYMALLOY, Berserk Bear, TG-4192, Crouching Yeti, IRON LIBERTY, Energetic Bear, Ghost Blizzard, BROMINE", "description": "Dragonfly is a cyber espionage group that has been attributed to Russia's Federal Security Service (FSB) Center 16. Active since at least 2010, Dragonfly has targeted defense and aviation companies, government entities, companies related to industrial control systems, and critical infrastructure sectors worldwide through supply chain, spearphishing, and drive-by compromise attacks.", "url": "/groups/G0035"}, {"id": "G0017", "name": "DragonOK", "associated_groups": "", "description": "DragonOK is a threat group that has targeted Japanese organizations with phishing emails. Due to overlapping TTPs, including similar custom tools, DragonOK is thought to have a direct or indirect relationship with the threat group Moafee.  It is known to use a variety of malware, including Sysget/HelloBridge, PlugX, PoisonIvy, FormerFirstRat, NFlog, and NewCT.", "url": "/groups/G0017"}, {"id": "G1006", "name": "Earth Lusca", "associated_groups": "TAG-22, Charcoal Typhoon, CHROMIUM, ControlX", "description": "Earth Lusca is a suspected China-based cyber espionage group that has been active since at least April 2019. Earth Lusca has targeted organizations in Australia, China, Hong Kong, Mongolia, Nepal, the Philippines, Taiwan, Thailand, Vietnam, the United Arab Emirates, Nigeria, Germany, France, and the United States. Targets included government institutions, news media outlets, gambling companies, educational institutions, COVID-19 research organizations, telecommunications companies, religious movements banned in China, and cryptocurrency trading platforms; security researchers assess some Earth Lusca operations may be financially motivated.Earth Lusca has used malware commonly used by other Chinese threat groups, including APT41 and the Winnti Group cluster, however security researchers assess Earth Lusca's techniques and infrastructure are separate.", "url": "/groups/G1006"}, {"id": "G0066", "name": "Elderwood", "associated_groups": "Elderwood Gang, Beijing Group, Sneaky Panda", "description": "Elderwood is a suspected Chinese cyber espionage group that was reportedly responsible for the 2009 Google intrusion known as Operation Aurora.  The group has targeted defense organizations, supply chain manufacturers, human rights and nongovernmental organizations (NGOs), and IT service providers.", "url": "/groups/G0066"}, {"id": "G1003", "name": "Ember Bear", "associated_groups": "Saint Bear, UNC2589, UAC-0056, Lorec53, Lorec Bear, Bleeding Bear", "description": "Ember Bear is a suspected Russian state-sponsored cyber espionage group that has been active since at least March 2021. Ember Bear has primarily focused their operations against Ukraine and Georgia, but has also targeted Western European and North American foreign ministries, pharmaceutical companies, and financial sector organizations. Security researchers assess Ember Bear likely conducted the WhisperGate destructive wiper attacks against Ukraine in early 2022.", "url": "/groups/G1003"}, {"id": "G0020", "name": "Equation", "associated_groups": "", "description": "Equation is a sophisticated threat group that employs multiple remote access tools. The group is known to use zero-day exploits and has developed the capability to overwrite the firmware of hard disk drives.", "url": "/groups/G0020"}, {"id": "G0120", "name": "Evilnum", "associated_groups": "", "description": "Evilnum is a financially motivated threat group that has been active since at least 2018.", "url": "/groups/G0120"}, {"id": "G1011", "name": "EXOTIC LILY", "associated_groups": "", "description": "EXOTIC LILY is a financially motivated group that has been closely linked with Wizard Spider and the deployment of ransomware including Conti and Diavol. EXOTIC LILY may be acting as an initial access broker for other malicious actors, and has targeted a wide range of industries including IT, cybersecurity, and healthcare since at least September 2021.", "url": "/groups/G1011"}, {"id": "G0137", "name": "Ferocious Kitten", "associated_groups": "", "description": "Ferocious Kitten is a threat group that has primarily targeted Persian-speaking individuals in Iran since at least 2015.", "url": "/groups/G0137"}, {"id": "G0051", "name": "FIN10", "associated_groups": "", "description": "FIN10 is a financially motivated threat group that has targeted organizations in North America since at least 2013 through 2016. The group uses stolen data exfiltrated from victims to extort organizations.", "url": "/groups/G0051"}, {"id": "G1016", "name": "FIN13", "associated_groups": "Elephant Beetle", "description": "FIN13 is a financially motivated cyber threat group that has targeted the financial, retail, and hospitality industries in Mexico and Latin America, as early as 2016. FIN13 achieves its objectives by stealing intellectual property, financial data, mergers and acquisition information, or PII.", "url": "/groups/G1016"}, {"id": "G0085", "name": "FIN4", "associated_groups": "", "description": "FIN4 is a financially-motivated threat group that has targeted confidential information related to the public financial market, particularly regarding healthcare and pharmaceutical companies, since at least 2013. FIN4 is unique in that they do not infect victims with typical persistent malware, but rather they focus on capturing credentials authorized to access email and other non-public correspondence.", "url": "/groups/G0085"}, {"id": "G0053", "name": "FIN5", "associated_groups": "", "description": "FIN5 is a financially motivated threat group that has targeted personally identifiable information and payment card information. The group has been active since at least 2008 and has targeted the restaurant, gaming, and hotel industries. The group is made up of actors who likely speak Russian.", "url": "/groups/G0053"}, {"id": "G0037", "name": "FIN6", "associated_groups": "Magecart Group 6, ITG08, Skeleton Spider, TAAL, Camouflage Tempest", "description": "FIN6 is a cyber crime group that has stolen payment card data and sold it for profit on underground marketplaces. This group has aggressively targeted and compromised point of sale (PoS) systems in the hospitality and retail sectors.", "url": "/groups/G0037"}, {"id": "G0046", "name": "FIN7", "associated_groups": "GOLD NIAGARA, ITG14, Carbon Spider, ELBRUS, Sangria Tempest", "description": "FIN7 is a financially-motivated threat group that has been active since 2013. FIN7 has primarily targeted the retail, restaurant, hospitality, software, consulting, financial services, medical equipment, cloud services, media, food and beverage, transportation, and utilities industries in the U.S. A portion of FIN7 was run out of a front company called Combi Security and often used point-of-sale malware for targeting efforts. Since 2020, FIN7 shifted operations to a big game hunting (BGH) approach including use of REvil ransomware and their own Ransomware as a Service (RaaS), Darkside. FIN7 may be linked to the Carbanak Group, but there appears to be several groups using Carbanak malware and are therefore tracked separately.", "url": "/groups/G0046"}, {"id": "G0061", "name": "FIN8", "associated_groups": "Syssphinx", "description": "FIN8 is a financially motivated threat group that has been active since at least January 2016, and known for targeting organizations in the hospitality, retail, entertainment, insurance, technology, chemical, and financial sectors. In June 2021, security researchers detected FIN8 switching from targeting point-of-sale (POS) devices to distributing a number of ransomware variants.", "url": "/groups/G0061"}, {"id": "G0117", "name": "Fox Kitten", "associated_groups": "UNC757, Parisite, Pioneer Kitten, RUBIDIUM, Lemon Sandstorm", "description": "Fox Kitten is threat actor with a suspected nexus to the Iranian government that has been active since at least 2017 against entities in the Middle East, North Africa, Europe, Australia, and North America. Fox Kitten has targeted multiple industrial verticals including oil and gas, technology, government, defense, healthcare, manufacturing, and engineering.", "url": "/groups/G0117"}, {"id": "G0093", "name": "GALLIUM", "associated_groups": "Granite Typhoon", "description": "GALLIUM is a cyberespionage group that has been active since at least 2012, primarily targeting telecommunications companies, financial institutions, and government entities in Afghanistan, Australia, Belgium, Cambodia, Malaysia, Mozambique, the Philippines, Russia, and Vietnam. This group is particularly known for launching Operation Soft Cell, a long-term campaign targeting telecommunications providers. Security researchers have identified GALLIUM as a likely Chinese state-sponsored group, based in part on tools used and TTPs commonly associated with Chinese threat actors.", "url": "/groups/G0093"}, {"id": "G0084", "name": "Gallmaker", "associated_groups": "", "description": "Gallmaker is a cyberespionage group that has targeted victims in the Middle East and has been active since at least December 2017. The group has mainly targeted victims in the defense, military, and government sectors.", "url": "/groups/G0084"}, {"id": "G0047", "name": "Gamaredon Group", "associated_groups": "IRON TILDEN, Primitive Bear, ACTINIUM, Armageddon, Shuckworm, DEV-0157, Aqua Blizzard", "description": "Gamaredon Group is a suspected Russian cyber espionage threat group that has targeted military, NGO, judiciary, law enforcement, and non-profit organizations in Ukraine since at least 2013. The name Gamaredon Group comes from a misspelling of the word \"Armageddon\", which was detected in the adversary's early campaigns.In November 2021, the Ukrainian government publicly attributed Gamaredon Group to Russia's Federal Security Service (FSB) Center 18.", "url": "/groups/G0047"}, {"id": "G0036", "name": "GCMAN", "associated_groups": "", "description": "GCMAN is a threat group that focuses on targeting banks for the purpose of transferring money to e-currency services.", "url": "/groups/G0036"}, {"id": "G0115", "name": "GOLD SOUTHFIELD", "associated_groups": "Pinchy Spider", "description": "GOLD SOUTHFIELD is a financially motivated threat group active since at least 2018 that operates the REvil Ransomware-as-a Service (RaaS). GOLD SOUTHFIELD provides backend infrastructure for affiliates recruited on underground forums to perpetrate high value deployments. By early 2020, GOLD SOUTHFIELD started capitalizing on the new trend of stealing data and further extorting the victim to pay for their data to not get publicly leaked.", "url": "/groups/G0115"}, {"id": "G0078", "name": "Gorgon Group", "associated_groups": "", "description": "Gorgon Group is a threat group consisting of members who are suspected to be Pakistan-based or have other connections to Pakistan. The group has performed a mix of criminal and targeted attacks, including campaigns against government organizations in the United Kingdom, Spain, Russia, and the United States.", "url": "/groups/G0078"}, {"id": "G0043", "name": "Group5", "associated_groups": "", "description": "Group5 is a threat group with a suspected Iranian nexus, though this attribution is not definite. The group has targeted individuals connected to the Syrian opposition via spearphishing and watering holes, normally using Syrian and Iranian themes. Group5 has used two commonly available remote access tools (RATs), njRAT and NanoCore, as well as an Android RAT, DroidJack.", "url": "/groups/G0043"}, {"id": "G0125", "name": "HAFNIUM", "associated_groups": "Operation Exchange Marauder, Silk Typhoon", "description": "HAFNIUM is a likely state-sponsored cyber espionage group operating out of China that has been active since at least January 2021. HAFNIUM primarily targets entities in the US across a number of industry sectors, including infectious disease researchers, law firms, higher education institutions, defense contractors, policy think tanks, and NGOs.", "url": "/groups/G0125"}, {"id": "G1001", "name": "HEXANE", "associated_groups": "Lyceum, Siamesekitten, Spirlin", "description": "HEXANE is a cyber espionage threat group that has targeted oil & gas, telecommunications, aviation, and internet service provider organizations since at least 2017. Targeted companies have been located in the Middle East and Africa, including Israel, Saudi Arabia, Kuwait, Morocco, and Tunisia. HEXANE's TTPs appear similar to APT33 and OilRig but due to differences in victims and tools it is tracked as a separate entity.", "url": "/groups/G1001"}, {"id": "G0126", "name": "Higaisa", "associated_groups": "", "description": "Higaisa is a threat group suspected to have South Korean origins. Higaisa has targeted government, public, and trade organizations in North Korea; however, they have also carried out attacks in China, Japan, Russia, Poland, and other nations. Higaisa was first disclosed in early 2019 but is assessed to have operated as early as 2009.", "url": "/groups/G0126"}, {"id": "G0100", "name": "Inception", "associated_groups": "Inception Framework, Cloud Atlas", "description": "Inception is a cyber espionage group active since at least 2014. The group has targeted multiple industries and governmental entities primarily in Russia, but has also been active in the United States and throughout Europe, Asia, Africa, and the Middle East.", "url": "/groups/G0100"}, {"id": "G0136", "name": "IndigoZebra", "associated_groups": "", "description": "IndigoZebra is a suspected Chinese cyber espionage group that has been targeting Central Asian governments since at least 2014.", "url": "/groups/G0136"}, {"id": "G0119", "name": "Indrik Spider", "associated_groups": "Evil Corp, Manatee Tempest, DEV-0243", "description": "Indrik Spider is a Russia-based cybercriminal group that has been active since at least 2014. Indrik Spider initially started with the Dridex banking Trojan, and then by 2017 they began running ransomware operations using BitPaymer, WastedLocker, and Hades ransomware. Following U.S. sanctions and an indictment in 2019, Indrik Spider changed their tactics and diversified their toolset.", "url": "/groups/G0119"}, {"id": "G0004", "name": "Ke3chang", "associated_groups": "APT15, Mirage, Vixen Panda, GREF, Playful Dragon, RoyalAPT, NICKEL, Nylon Typhoon", "description": "Ke3chang is a threat group attributed to actors operating out of China. Ke3chang has targeted oil, government, diplomatic, military, and NGOs in Central and South America, the Caribbean, Europe, and North America since at least 2010.", "url": "/groups/G0004"}, {"id": "G0094", "name": "Kimsuky", "associated_groups": "Black Banshee, Velvet Chollima, Emerald Sleet, THALLIUM", "description": "Kimsuky is a North Korea-based cyber espionage group that has been active since at least 2012. The group initially focused on targeting South Korean government entities, think tanks, and individuals identified as experts in various fields, and expanded its operations to include the United States, Russia, Europe, and the UN. Kimsuky has focused its intelligence collection activities on foreign policy and national security issues related to the Korean peninsula, nuclear policy, and sanctions.Kimsuky was assessed to be responsible for the 2014 Korea Hydro & Nuclear Power Co. compromise; other notable campaigns include Operation STOLEN PENCIL (2018), Operation Kabar Cobra (2019), and Operation Smoke Screen (2019).North Korean group definitions are known to have significant overlap, and some security researchers report all North Korean state-sponsored cyber activity under the name Lazarus Group instead of tracking clusters or subgroups.", "url": "/groups/G0094"}, {"id": "G1004", "name": "LAPSUS$", "associated_groups": "DEV-0537, Strawberry Tempest", "description": "LAPSUS$ is cyber criminal threat group that has been active since at least mid-2021. LAPSUS$ specializes in large-scale social engineering and extortion operations, including destructive attacks without the use of ransomware. The group has targeted organizations globally, including in the government, manufacturing, higher education, energy, healthcare, technology, telecommunications, and media sectors.", "url": "/groups/G1004"}, {"id": "G0032", "name": "Lazarus Group", "associated_groups": "Labyrinth Chollima, HIDDEN COBRA, Guardians of Peace, ZINC, NICKEL ACADEMY, Diamond Sleet", "description": "Lazarus Group is a North Korean state-sponsored cyber threat group that has been attributed to the Reconnaissance General Bureau. The group has been active since at least 2009 and was reportedly responsible for the November 2014 destructive wiper attack against Sony Pictures Entertainment as part of a campaign named Operation Blockbuster by Novetta. Malware used by Lazarus Group correlates to other reported campaigns, including Operation Flame, Operation 1Mission, Operation Troy, DarkSeoul, and Ten Days of Rain.North Korean group definitions are known to have significant overlap, and some security researchers report all North Korean state-sponsored cyber activity under the name Lazarus Group instead of tracking clusters or subgroups, such as Andariel, APT37, APT38, and Kimsuky.", "url": "/groups/G0032"}, {"id": "G0140", "name": "LazyScripter", "associated_groups": "", "description": "LazyScripter is threat group that has mainly targeted the airlines industry since at least 2018, primarily using open-source toolsets.", "url": "/groups/G0140"}, {"id": "G0077", "name": "Leafminer", "associated_groups": "Raspite", "description": "Leafminer is an Iranian threat group that has targeted government organizations and business entities in the Middle East since at least early 2017.", "url": "/groups/G0077"}, {"id": "G0065", "name": "Leviathan", "associated_groups": "MUDCARP, Kryptonite Panda, Gadolinium, BRONZE MOHAWK, TEMP.Jumper, APT40, TEMP.Periscope, Gingham Typhoon", "description": "Leviathan is a Chinese state-sponsored cyber espionage group that has been attributed to the Ministry of State Security's (MSS) Hainan State Security Department and an affiliated front company. Active since at least 2009, Leviathan has targeted the following sectors: academia, aerospace/aviation, biomedical, defense industrial base, government, healthcare, manufacturing, maritime, and transportation across the US, Canada, Europe, the Middle East, and Southeast Asia.", "url": "/groups/G0065"}, {"id": "G0030", "name": "Lotus Blossom", "associated_groups": "DRAGONFISH, Spring Dragon, RADIUM, Raspberry Typhoon", "description": "Lotus Blossom is a threat group that has targeted government and military organizations in Southeast Asia.", "url": "/groups/G0030"}, {"id": "G1014", "name": "LuminousMoth", "associated_groups": "", "description": "LuminousMoth is a Chinese-speaking cyber espionage group that has been active since at least October 2020. LuminousMoth has targeted high-profile organizations, including government entities, in Myanmar, the Philippines, Thailand, and other parts of Southeast Asia. Some security researchers have concluded there is a connection between LuminousMoth and Mustang Panda based on similar targeting and TTPs, as well as network infrastructure overlaps.", "url": "/groups/G1014"}, {"id": "G0095", "name": "Machete", "associated_groups": "APT-C-43, El Machete", "description": "Machete is a suspected Spanish-speaking cyber espionage group that has been active since at least 2010. It has primarily focused its operations within Latin America, with a particular emphasis on Venezuela, but also in the US, Europe, Russia, and parts of Asia. Machete generally targets high-profile organizations such as government institutions, intelligence services, and military units, as well as telecommunications and power companies.", "url": "/groups/G0095"}, {"id": "G0059", "name": "Magic Hound", "associated_groups": "TA453, COBALT ILLUSION, Charming Kitten, ITG18, Phosphorus, Newscaster, APT35, Mint Sandstorm", "description": "Magic Hound is an Iranian-sponsored threat group that conducts long term, resource-intensive cyber espionage operations, likely on behalf of the Islamic Revolutionary Guard Corps. They have targeted European, U.S., and Middle Eastern government and military personnel, academics, journalists, and organizations such as the World Health Organization (WHO), via complex social engineering campaigns since at least 2014.", "url": "/groups/G0059"}, {"id": "G1026", "name": "Malteiro", "associated_groups": "", "description": "Malteiro is a financially motivated criminal group that is likely based in Brazil and has been active since at least November 2019. The group operates and distributes the Mispadu  banking trojan via a Malware-as-a-Service (MaaS) business model. Malteiro mainly targets victims throughout Latin America (particularly Mexico) and Europe (particularly Spain and Portugal).", "url": "/groups/G1026"}, {"id": "G0045", "name": "menuPass", "associated_groups": "Cicada, POTASSIUM, Stone Panda, APT10, Red Apollo, CVNX, HOGFISH, BRONZE RIVERSIDE", "description": "menuPass is a threat group that has been active since at least 2006. Individual members of menuPass are known to have acted in association with the Chinese Ministry of State Security's (MSS) Tianjin State Security Bureau and worked for the Huaying Haitai Science and Technology Development Company.menuPass has targeted healthcare, defense, aerospace, finance, maritime, biotechnology, energy, and government sectors globally, with an emphasis on Japanese organizations. In 2016 and 2017, the group is known to have targeted managed IT service providers (MSPs), manufacturing and mining companies, and a university.", "url": "/groups/G0045"}, {"id": "G1013", "name": "Metador", "associated_groups": "", "description": "Metador is a suspected cyber espionage group that was first reported in September 2022. Metador has targeted a limited number of telecommunication companies, internet service providers, and universities in the Middle East and Africa. Security researchers named the group Metador based on the \"I am meta\" string in one of the group's malware samples and the expectation of Spanish-language responses from C2 servers.", "url": "/groups/G1013"}, {"id": "G0002", "name": "Moafee", "associated_groups": "", "description": "Moafee is a threat group that appears to operate from the Guandong Province of China. Due to overlapping TTPs, including similar custom tools, Moafee is thought to have a direct or indirect relationship with the threat group DragonOK.", "url": "/groups/G0002"}, {"id": "G0103", "name": "Mofang", "associated_groups": "", "description": "Mofang is a likely China-based cyber espionage group, named for its frequent practice of imitating a victim's infrastructure. This adversary has been observed since at least May 2012 conducting focused attacks against government and critical infrastructure in Myanmar, as well as several other countries and sectors including military, automobile, and weapons industries.", "url": "/groups/G0103"}, {"id": "G0021", "name": "Molerats", "associated_groups": "Operation Molerats, Gaza Cybergang", "description": "Molerats is an Arabic-speaking, politically-motivated threat group that has been operating since 2012. The group's victims have primarily been in the Middle East, Europe, and the United States.", "url": "/groups/G0021"}, {"id": "G1009", "name": "Moses Staff", "associated_groups": "DEV-0500, Marigold Sandstorm", "description": "Moses Staff is a suspected Iranian threat group that has primarily targeted Israeli companies since at least September 2021. Moses Staff openly stated their motivation in attacking Israeli companies is to cause damage by leaking stolen sensitive data and encrypting the victim's networks without a ransom demand. Security researchers assess Moses Staff is politically motivated, and has targeted government, finance, travel, energy, manufacturing, and utility companies outside of Israel as well, including those in Italy, India, Germany, Chile, Turkey, the UAE, and the US.", "url": "/groups/G1009"}, {"id": "G1019", "name": "MoustachedBouncer", "associated_groups": "", "description": "MoustachedBouncer is a cyberespionage group that has been active since at least 2014 targeting foreign embassies in Belarus.", "url": "/groups/G1019"}, {"id": "G0069", "name": "MuddyWater", "associated_groups": "Earth Vetala, MERCURY, Static Kitten, Seedworm, TEMP.Zagros, Mango Sandstorm, TA450", "description": "MuddyWater is a cyber espionage group assessed to be a subordinate element within Iran's Ministry of Intelligence and Security (MOIS). Since at least 2017, MuddyWater has targeted a range of government and private organizations across sectors, including telecommunications, local government, defense, and oil and natural gas organizations, in the Middle East, Asia, Africa, Europe, and North America.", "url": "/groups/G0069"}, {"id": "G0129", "name": "Mustang Panda", "associated_groups": "TA416, RedDelta, BRONZE PRESIDENT", "description": "Mustang Panda is a China-based cyber espionage threat actor that was first observed in 2017 but may have been conducting operations since at least 2014. Mustang Panda has targeted government entities, nonprofits, religious, and other non-governmental organizations in the U.S., Europe, Mongolia, Myanmar, Pakistan, and Vietnam, among others.", "url": "/groups/G0129"}, {"id": "G1020", "name": "Mustard Tempest", "associated_groups": "DEV-0206, TA569, GOLD PRELUDE, UNC1543", "description": "Mustard Tempest is an initial access broker that has operated the SocGholish distribution network since at least 2017. Mustard Tempest has partnered with Indrik Spider to provide access for the download of additional malware including LockBit, WastedLocker, and remote access tools.", "url": "/groups/G1020"}, {"id": "G0019", "name": "Naikon", "associated_groups": "", "description": "Naikon is assessed to be a state-sponsored cyber espionage group attributed to the Chinese People’s Liberation Army’s (PLA) Chengdu Military Region Second Technical Reconnaissance Bureau (Military Unit Cover Designator 78020). Active since at least 2010, Naikon has primarily conducted operations against government, military, and civil organizations in Southeast Asia, as well as against international bodies such as the United Nations Development Programme (UNDP) and the Association of Southeast Asian Nations (ASEAN). While Naikon shares some characteristics with APT30, the two groups do not appear to be exact matches.", "url": "/groups/G0019"}, {"id": "G0055", "name": "NEODYMIUM", "associated_groups": "", "description": "NEODYMIUM is an activity group that conducted a campaign in May 2016 and has heavily targeted Turkish victims. The group has demonstrated similarity to another activity group called PROMETHIUM due to overlapping victim and campaign characteristics.   NEODYMIUM is reportedly associated closely with BlackOasis operations, but evidence that the group names are aliases has not been identified.", "url": "/groups/G0055"}, {"id": "G0133", "name": "Nomadic Octopus", "associated_groups": "DustSquad", "description": "Nomadic Octopus is a Russian-speaking cyber espionage threat group that has primarily targeted Central Asia, including local governments, diplomatic missions, and individuals, since at least 2014. Nomadic Octopus has been observed conducting campaigns involving Android and Windows malware, mainly using the Delphi programming language, and building custom variants.", "url": "/groups/G0133"}, {"id": "G0049", "name": "OilRig", "associated_groups": "COBALT GYPSY, IRN2, APT34, Helix Kitten, Evasive Serpens, Hazel Sandstorm, EUROPIUM", "description": "OilRig is a suspected Iranian threat group that has targeted Middle Eastern and international victims since at least 2014. The group has targeted a variety of sectors, including financial, government, energy, chemical, and telecommunications. It appears the group carries out supply chain attacks, leveraging the trust relationship between organizations to attack their primary targets. The group works on behalf of the Iranian government based on infrastructure details that contain references to Iran, use of Iranian infrastructure, and targeting that aligns with nation-state interests.", "url": "/groups/G0049"}, {"id": "G0071", "name": "Orangeworm", "associated_groups": "", "description": "Orangeworm is a group that has targeted organizations in the healthcare sector in the United States, Europe, and Asia since at least 2015, likely for the purpose of corporate espionage. Reverse engineering of Kwampirs, directly associated with Orangeworm activity, indicates significant functional and development overlaps with Shamoon.", "url": "/groups/G0071"}, {"id": "G0040", "name": "Patchwork", "associated_groups": "Hangover Group, Dropping Elephant, Chinastrats, MONSOON, Operation Hangover", "description": "Patchwork is a cyber espionage group that was first observed in December 2015. While the group has not been definitively attributed, circumstantial evidence suggests the group may be a pro-Indian or Indian entity. Patchwork has been seen targeting industries related to diplomatic and government agencies. Much of the code used by this group was copied and pasted from online forums. Patchwork was also seen operating spearphishing campaigns targeting U.S. think tank groups in March and April of 2018.", "url": "/groups/G0040"}, {"id": "G0011", "name": "PittyTiger", "associated_groups": "", "description": "PittyTiger is a threat group believed to operate out of China that uses multiple different types of malware to maintain command and control.", "url": "/groups/G0011"}, {"id": "G0068", "name": "PLATINUM", "associated_groups": "", "description": "PLATINUM is an activity group that has targeted victims since at least 2009. The group has focused on targets associated with governments and related organizations in South and Southeast Asia.", "url": "/groups/G0068"}, {"id": "G1005", "name": "POLONIUM", "associated_groups": "Plaid Rain", "description": "POLONIUM is a Lebanon-based group that has primarily targeted Israeli organizations, including critical manufacturing, information technology, and defense industry companies, since at least February 2022. Security researchers assess POLONIUM has coordinated their operations with multiple actors affiliated with Iran’s Ministry of Intelligence and Security (MOIS), based on victim overlap as well as common techniques and tooling.", "url": "/groups/G1005"}, {"id": "G0033", "name": "Poseidon Group", "associated_groups": "", "description": "Poseidon Group is a Portuguese-speaking threat group that has been active since at least 2005. The group has a history of using information exfiltrated from victims to blackmail victim companies into contracting the Poseidon Group as a security firm.", "url": "/groups/G0033"}, {"id": "G0056", "name": "PROMETHIUM", "associated_groups": "StrongPity", "description": "PROMETHIUM is an activity group focused on espionage that has been active since at least 2012. The group has conducted operations globally with a heavy emphasis on Turkish targets. PROMETHIUM has demonstrated similarity to another activity group called NEODYMIUM due to overlapping victim and campaign characteristics.", "url": "/groups/G0056"}, {"id": "G0024", "name": "Putter Panda", "associated_groups": "APT2, MSUpdater", "description": "Putter Panda is a Chinese threat group that has been attributed to Unit 61486 of the 12th Bureau of the PLA’s 3rd General Staff Department (GSD).", "url": "/groups/G0024"}, {"id": "G0075", "name": "Rancor", "associated_groups": "", "description": "Rancor is a threat group that has led targeted campaigns against the South East Asia region. Rancor uses politically-motivated lures to entice victims to open malicious documents.", "url": "/groups/G0075"}, {"id": "G0106", "name": "Rocke", "associated_groups": "", "description": "Rocke is an alleged Chinese-speaking adversary whose primary objective appeared to be cryptojacking, or stealing victim system resources for the purposes of mining cryptocurrency. The name Rocke comes from the email address \"rocke@live.cn\" used to create the wallet which held collected cryptocurrency. Researchers have detected overlaps between Rocke and the Iron Cybercrime Group, though this attribution has not been confirmed.", "url": "/groups/G0106"}, {"id": "G0048", "name": "RTM", "associated_groups": "", "description": "RTM is a cybercriminal group that has been active since at least 2015 and is primarily interested in users of remote banking systems in Russia and neighboring countries. The group uses a Trojan by the same name (RTM).", "url": "/groups/G0048"}, {"id": "G0034", "name": "Sandworm Team", "associated_groups": "ELECTRUM, Telebots, IRON VIKING, BlackEnergy (Group), Quedagh, Voodoo Bear, IRIDIUM, Seashell Blizzard, FROZENBARENTS", "description": "Sandworm Team is a destructive threat group that has been attributed to Russia's General Staff Main Intelligence Directorate (GRU) Main Center for Special Technologies (GTsST) military unit 74455. This group has been active since at least 2009.In October 2020, the US indicted six GRU Unit 74455 officers associated with Sandworm Team for the following cyber operations: the 2015 and 2016 attacks against Ukrainian electrical companies and government organizations, the 2017 worldwide NotPetya attack, targeting of the 2017 French presidential campaign, the 2018 Olympic Destroyer attack against the Winter Olympic Games, the 2018 operation against the Organisation for the Prohibition of Chemical Weapons, and attacks against the country of Georgia in 2018 and 2019. Some of these were conducted with the assistance of GRU Unit 26165, which is also referred to as APT28.", "url": "/groups/G0034"}, {"id": "G0029", "name": "Scarlet Mimic", "associated_groups": "", "description": "Scarlet Mimic is a threat group that has targeted minority rights activists. This group has not been directly linked to a government source, but the group's motivations appear to overlap with those of the Chinese government. While there is some overlap between IP addresses used by Scarlet Mimic and Putter Panda, it has not been concluded that the groups are the same.", "url": "/groups/G0029"}, {"id": "G1015", "name": "Scattered Spider", "associated_groups": "Roasted 0ktapus, Octo Tempest, Storm-0875", "description": "Scattered Spider is a native English-speaking cybercriminal group that has been active since at least 2022. The group initially targeted customer relationship management and business-process outsourcing (BPO) firms as well as telecommunications and technology companies. Beginning in 2023, Scattered Spider expanded its operations to compromise victims in the gaming, hospitality, retail, MSP, manufacturing, and financial sectors. During campaigns, Scattered Spider has leveraged targeted social-engineering techniques, attempted to bypass popular endpoint security tools, and more recently, deployed ransomware for financial gain.", "url": "/groups/G1015"}, {"id": "G1008", "name": "SideCopy", "associated_groups": "", "description": "SideCopy is a Pakistani threat group that has primarily targeted South Asian countries, including Indian and Afghani government personnel, since at least 2019. SideCopy's name comes from its infection chain that tries to mimic that of Sidewinder, a suspected Indian threat group.", "url": "/groups/G1008"}, {"id": "G0121", "name": "Sidewinder", "associated_groups": "T-APT-04, Rattlesnake", "description": "Sidewinder is a suspected Indian threat actor group that has been active since at least 2012. They have been observed targeting government, military, and business entities throughout Asia, primarily focusing on Pakistan, China, Nepal, and Afghanistan.", "url": "/groups/G0121"}, {"id": "G0091", "name": "Silence", "associated_groups": "Whisper Spider", "description": "Silence is a financially motivated threat actor targeting financial institutions in different countries. The group was first seen in June 2016. Their main targets reside in Russia, Ukraine, Belarus, Azerbaijan, Poland and Kazakhstan. They compromised various banking systems, including the Russian Central Bank's Automated Workstation Client, ATMs, and card processing.", "url": "/groups/G0091"}, {"id": "G0122", "name": "Silent Librarian", "associated_groups": "TA407, COBALT DICKENS", "description": "Silent Librarian is a group that has targeted research and proprietary data at universities, government agencies, and private sector companies worldwide since at least 2013. Members of  Silent Librarian are known to have been affiliated with the Iran-based Mabna Institute which has conducted cyber intrusions at the behest of the government of Iran, specifically the Islamic Revolutionary Guard Corps (IRGC).", "url": "/groups/G0122"}, {"id": "G0083", "name": "SilverTerrier", "associated_groups": "", "description": "SilverTerrier is a Nigerian threat group that has been seen active since 2014. SilverTerrier mainly targets organizations in high technology, higher education, and manufacturing.", "url": "/groups/G0083"}, {"id": "G0054", "name": "Sowbug", "associated_groups": "", "description": "Sowbug is a threat group that has conducted targeted attacks against organizations in South America and Southeast Asia, particularly government entities, since at least 2015.", "url": "/groups/G0054"}, {"id": "G0038", "name": "Stealth Falcon", "associated_groups": "", "description": "Stealth Falcon is a threat group that has conducted targeted spyware attacks against Emirati journalists, activists, and dissidents since at least 2012. Circumstantial evidence suggests there could be a link between this group and the United Arab Emirates (UAE) government, but that has not been confirmed.", "url": "/groups/G0038"}, {"id": "G0041", "name": "Strider", "associated_groups": "ProjectSauron", "description": "Strider is a threat group that has been active since at least 2011 and has targeted victims in Russia, China, Sweden, Belgium, Iran, and Rwanda.", "url": "/groups/G0041"}, {"id": "G0039", "name": "Suckfly", "associated_groups": "", "description": "Suckfly is a China-based threat group that has been active since at least 2014.", "url": "/groups/G0039"}, {"id": "G1018", "name": "TA2541", "associated_groups": "", "description": "TA2541 is a cybercriminal group that has been targeting the aviation, aerospace, transportation, manufacturing, and defense industries since at least 2017. TA2541 campaigns are typically high volume and involve the use of commodity remote access tools obfuscated by crypters and themes related to aviation, transportation, and travel.", "url": "/groups/G1018"}, {"id": "G0062", "name": "TA459", "associated_groups": "", "description": "TA459 is a threat group believed to operate out of China that has targeted countries including Russia, Belarus, Mongolia, and others.", "url": "/groups/G0062"}, {"id": "G0092", "name": "TA505", "associated_groups": "Hive0065, Spandex Tempest, CHIMBORAZO", "description": "TA505 is a cyber criminal group that has been active since at least 2014. TA505 is known for frequently changing malware, driving global trends in criminal malware distribution, and ransomware campaigns involving Clop.", "url": "/groups/G0092"}, {"id": "G0127", "name": "TA551", "associated_groups": "GOLD CABIN, Shathak", "description": "TA551 is a financially-motivated threat group that has been active since at least 2018.  The group has primarily targeted English, German, Italian, and Japanese speakers through email-based malware distribution campaigns.", "url": "/groups/G0127"}, {"id": "G0139", "name": "TeamTNT", "associated_groups": "", "description": "TeamTNT is a threat group that has primarily targeted cloud and containerized environments. The group as been active since at least October 2019 and has mainly focused its efforts on leveraging cloud and container resources to deploy cryptocurrency miners in victim environments.", "url": "/groups/G0139"}, {"id": "G0088", "name": "TEMP.Veles", "associated_groups": "XENOTIME", "description": "TEMP.Veles is a Russia-based threat group that has targeted critical infrastructure. The group has been observed utilizing TRITON, a malware framework designed to manipulate industrial safety systems.", "url": "/groups/G0088"}, {"id": "G0089", "name": "The White Company", "associated_groups": "", "description": "The White Company is a likely state-sponsored threat actor with advanced capabilities. From 2017 through 2018, the group led an espionage campaign called Operation Shaheen targeting government and military organizations in Pakistan.", "url": "/groups/G0089"}, {"id": "G0028", "name": "Threat Group-1314", "associated_groups": "TG-1314", "description": "Threat Group-1314 is an unattributed threat group that has used compromised credentials to log into a victim's remote access infrastructure.", "url": "/groups/G0028"}, {"id": "G0027", "name": "Threat Group-3390", "associated_groups": "Earth Smilodon, TG-3390, Emissary Panda, BRONZE UNION, APT27, Iron Tiger, LuckyMouse", "description": "Threat Group-3390 is a Chinese threat group that has extensively used strategic Web compromises to target victims. The group has been active since at least 2010 and has targeted organizations in the aerospace, government, defense, technology, energy, manufacturing and gambling/betting sectors.", "url": "/groups/G0027"}, {"id": "G0076", "name": "Thrip", "associated_groups": "", "description": "Thrip is an espionage group that has targeted satellite communications, telecoms, and defense contractor companies in the U.S. and Southeast Asia. The group uses custom malware as well as \"living off the land\" techniques.", "url": "/groups/G0076"}, {"id": "G1022", "name": "ToddyCat", "associated_groups": "", "description": "ToddyCat is a sophisticated threat group that has been active since at least 2020 using custom loaders and malware in multi-stage infection chains against government and military targets across Europe and Asia.", "url": "/groups/G1022"}, {"id": "G0131", "name": "Tonto Team", "associated_groups": "Earth Akhlut, BRONZE HUNTLEY, CactusPete, Karma Panda", "description": "Tonto Team is a suspected Chinese state-sponsored cyber espionage threat group that has primarily targeted South Korea, Japan, Taiwan, and the United States since at least 2009; by 2020 they expanded operations to include other Asian as well as Eastern European countries. Tonto Team has targeted government, military, energy, mining, financial, education, healthcare, and technology organizations, including through the Heartbeat Campaign (2009-2012) and Operation Bitter Biscuit (2017).", "url": "/groups/G0131"}, {"id": "G0134", "name": "Transparent Tribe", "associated_groups": "COPPER FIELDSTONE, APT36, Mythic Leopard, ProjectM", "description": "Transparent Tribe is a suspected Pakistan-based threat group that has been active since at least 2013, primarily targeting diplomatic, defense, and research organizations in India and Afghanistan.", "url": "/groups/G0134"}, {"id": "G0081", "name": "Tropic Trooper", "associated_groups": "Pirate Panda, KeyBoy", "description": "Tropic Trooper is an unaffiliated threat group that has led targeted campaigns against targets in Taiwan, the Philippines, and Hong Kong. Tropic Trooper focuses on targeting government, healthcare, transportation, and high-tech industries and has been active since 2011.", "url": "/groups/G0081"}, {"id": "G0010", "name": "Turla", "associated_groups": "IRON HUNTER, Group 88, Waterbug, WhiteBear, Snake, Krypton, Venomous Bear, Secret Blizzard, BELUGASTURGEON", "description": "Turla is a cyber espionage threat group that has been attributed to Russia's Federal Security Service (FSB).  They have compromised victims in over 50 countries since at least 2004, spanning a range of industries including government, embassies, military, education, research and pharmaceutical companies. Turla is known for conducting watering hole and spearphishing campaigns, and leveraging in-house tools and malware, such as Uroburos.", "url": "/groups/G0010"}, {"id": "G1029", "name": "UNC788", "associated_groups": "", "description": "UNC788 is a group of hackers from Iran that has targeted people in the Middle East.", "url": "/groups/G1029"}, {"id": "G0123", "name": "Volatile Cedar", "associated_groups": "Lebanese Cedar", "description": "Volatile Cedar is a Lebanese threat group that has targeted individuals, companies, and institutions worldwide. Volatile Cedar has been operating since 2012 and is motivated by political and ideological interests.", "url": "/groups/G0123"}, {"id": "G1017", "name": "Volt Typhoon", "associated_groups": "BRONZE SILHOUETTE", "description": "Volt Typhoon is a People's Republic of China (PRC) state-sponsored actor that has been active since at least 2021. Volt Typhoon typically focuses on espionage and information gathering and has targeted critical infrastructure organizations in the US including Guam. Volt Typhoon has emphasized stealth in operations using web shells, living-off-the-land (LOTL) binaries, hands on keyboard activities, and stolen credentials.", "url": "/groups/G1017"}, {"id": "G0107", "name": "Whitefly", "associated_groups": "", "description": "Whitefly is a cyber espionage group that has been operating since at least 2017. The group has targeted organizations based mostly in Singapore across a wide variety of sectors, and is primarily interested in stealing large amounts of sensitive information. The group has been linked to an attack against Singapore’s largest public health organization, SingHealth.", "url": "/groups/G0107"}, {"id": "G0124", "name": "Windigo", "associated_groups": "", "description": "The Windigo group has been operating since at least 2011, compromising thousands of Linux and Unix servers using the Ebury SSH backdoor to create a spam botnet. Despite law enforcement intervention against the creators, Windigo operators continued updating Ebury through 2019.", "url": "/groups/G0124"}, {"id": "G0112", "name": "Windshift", "associated_groups": "Bahamut", "description": "Windshift is a threat group that has been active since at least 2017, targeting specific individuals for surveillance in government departments and critical infrastructure across the Middle East.", "url": "/groups/G0112"}, {"id": "G0044", "name": "Winnti Group", "associated_groups": "Blackfly", "description": "Winnti Group is a threat group with Chinese origins that has been active since at least 2010. The group has heavily targeted the gaming industry, but it has also expanded the scope of its targeting. Some reporting suggests a number of other groups, including Axiom, APT17, and Ke3chang, are closely linked to Winnti Group.", "url": "/groups/G0044"}, {"id": "G0090", "name": "WIRTE", "associated_groups": "", "description": "WIRTE is a threat group that has been active since at least August 2018. WIRTE has targeted government, diplomatic, financial, military, legal, and technology organizations in the Middle East and Europe.", "url": "/groups/G0090"}, {"id": "G0102", "name": "Wizard Spider", "associated_groups": "UNC1878, TEMP.MixMaster, Grim Spider, FIN12, GOLD BLACKBURN, ITG23, Periwinkle Tempest, DEV-0193", "description": "Wizard Spider is a Russia-based financially motivated threat group originally known for the creation and deployment of TrickBot since at least 2016. Wizard Spider possesses a diverse aresenal of tools and has conducted ransomware campaigns against a variety of organizations, ranging from major corporations to hospitals.", "url": "/groups/G0102"}, {"id": "G0128", "name": "ZIRCONIUM", "associated_groups": "APT31, Violet Typhoon", "description": "ZIRCONIUM is a threat group operating out of China, active since at least 2017, that has targeted individuals associated with the 2020 US presidential election and prominent leaders in the international affairs community.", "url": "/groups/G0128"}]